In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

In [9]:
dataset = load_dataset('lukebarousse/data_jobs')
df=dataset['train'].to_pandas()

In [12]:
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [13]:
df.sample(3)

                  job_title_short  ...                                    job_type_skills
303233       Senior Data Engineer  ...  {'cloud': ['gcp', 'aws'], 'other': ['ansible',...
189009               Data Analyst  ...                                               None
320134  Machine Learning Engineer  ...                   {'programming': ['python', 'r']}

[3 rows x 17 columns]

In [15]:
df.index

RangeIndex(start=0, stop=785741, step=1)

In [16]:
df.index.dtype

dtype('int64')

In [17]:
df.index.name

In [18]:
df.index.name = 'job_index'

In [19]:
df.index.name

'job_index'

In [20]:
df.sample(3)

                     job_title_short  ...                                    job_type_skills
job_index                             ...
51336      Machine Learning Engineer  ...  {'cloud': ['azure', 'gcp'], 'libraries': ['pys...
233831                 Data Engineer  ...                                               None
44400          Senior Data Scientist  ...  {'analyst_tools': ['power bi'], 'cloud': ['azu...

[3 rows x 17 columns]

Example 2

In [35]:
median_pivot = df.pivot_table(values='salary_year_avg', index= 'job_title_short', aggfunc='median')

In [36]:
median_pivot

                           salary_year_avg
job_title_short
Business Analyst                   85000.0
Cloud Engineer                     90000.0
Data Analyst                       90000.0
Data Engineer                     125000.0
Data Scientist                    127500.0
Machine Learning Engineer         106415.0
Senior Data Analyst               111175.0
Senior Data Engineer              147500.0
Senior Data Scientist             155500.0
Software Engineer                  99150.0

In [24]:
index_name = median_pivot.index.name

In [25]:
index_name

'job_title_short'

In [37]:
median_pivot

                           salary_year_avg
job_title_short
Business Analyst                   85000.0
Cloud Engineer                     90000.0
Data Analyst                       90000.0
Data Engineer                     125000.0
Data Scientist                    127500.0
Machine Learning Engineer         106415.0
Senior Data Analyst               111175.0
Senior Data Engineer              147500.0
Senior Data Scientist             155500.0
Software Engineer                  99150.0

In [26]:
median_pivot.index.name

'job_title_short'

In [28]:
median_pivot.index.dtype

dtype('O')

reset_index()

In [39]:
median_pivot.reset_index(inplace=True)

In [49]:
median_pivot

             job_title_short  salary_year_avg
0           Business Analyst          85000.0
1             Cloud Engineer          90000.0
2               Data Analyst          90000.0
3              Data Engineer         125000.0
4             Data Scientist         127500.0
5  Machine Learning Engineer         106415.0
6        Senior Data Analyst         111175.0
7       Senior Data Engineer         147500.0
8      Senior Data Scientist         155500.0
9          Software Engineer          99150.0

In [53]:
median_pivot.index.name = 'job_index'

In [55]:
median_pivot.index.name

'job_index'

sort_index()

In [56]:
median_pivot.sort_index()

                     job_title_short  salary_year_avg
job_index
0                   Business Analyst          85000.0
1                     Cloud Engineer          90000.0
2                       Data Analyst          90000.0
3                      Data Engineer         125000.0
4                     Data Scientist         127500.0
5          Machine Learning Engineer         106415.0
6                Senior Data Analyst         111175.0
7               Senior Data Engineer         147500.0
8              Senior Data Scientist         155500.0
9                  Software Engineer          99150.0